src/Reports/ОтчетПоНормамКанбанов/ОтчетПоНормамКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормамКанбанов</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТехОперации/ТехОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехОперации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Технологическая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоНормамКанбанов/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидОтчёта = 1;
НаДату = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(Спецификация)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
 
ОблЭтапОбщая = Макет.ПолучитьОбласть("Этап|Общая");
ОблЭтапНормаВремени = Макет.ПолучитьОбласть("Этап|НормаВремени");
ОблЭтапТрудоёмкость = Макет.ПолучитьОбласть("Этап|Трудоёмкость");
ОблЭтапРасценка = Макет.ПолучитьОбласть("Этап|Расценка");
ОблЭтапРасценкаИтого = Макет.ПолучитьОбласть("Этап|РасценкаИтого");		

НормРасх = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Спецификация,Отчет.НаДату);
	Пока НормРасх.Следующий() Цикл			
		Если НормРасх.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
			Если Не НормРасх.Элемент.Канбан.Пустая() Тогда
				Если СписокВидовКанбанов.НайтиПоЗначению(НормРасх.Элемент.Канбан) = Неопределено Тогда
				Продолжить;
				КонецЕсли;
			КонецЕсли;
		ТабДок.НачатьГруппуСтрок("Этап", Ложь);
		ОблЭтапОбщая.Параметры.Наименование = СокрЛП(НормРасх.Элемент.Наименование);
		ОблЭтапОбщая.Параметры.МПЗ = НормРасх.Элемент;
		ТабДок.Вывести(ОблЭтапОбщая);
			Если ВидОтчёта = 1 Тогда
				Для каждого ТО Из СписокТО Цикл
				ТабДок.Присоединить(ОблЭтапНормаВремени);
				КонецЦикла;
			ТабДок.Присоединить(ОблЭтапТрудоёмкость);
			Иначе
				Для каждого ТО Из СписокТО Цикл
				ТабДок.Присоединить(ОблЭтапРасценка);
				КонецЦикла;
			ТабДок.Присоединить(ОблЭтапРасценкаИтого);
			КонецЕсли;				
		ТабДок.ЗакончитьГруппуСтрок();
		РаскрытьНаМПЗ(НормРасх.Элемент);			 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос;
СписокНоменклатуры = Новый СписокЗначений;

СписокТО.Очистить();
ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",СписокВидовКанбанов[0].Значение.Подразделение);
ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли;
			Если ВыборкаТО.ДополнительныеРаботы Тогда
			Продолжить;
			КонецЕсли; 
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Код);
	КонецЦикла;
СписокТО.СортироватьПоПредставлению(); 
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаНормаВремени = Макет.ПолучитьОбласть("Шапка|НормаВремени");
ОблШапкаТрудоёмкость = Макет.ПолучитьОбласть("Шапка|Трудоёмкость");
ОблШапкаРасценка = Макет.ПолучитьОбласть("Шапка|Расценка");
ОблШапкаРасценкаИтого = Макет.ПолучитьОбласть("Шапка|РасценкаИтого");
ОблМПЗОбщая = Макет.ПолучитьОбласть("МПЗ|Общая");
ОблМПЗНормаВремени = Макет.ПолучитьОбласть("МПЗ|НормаВремени");
ОблМПЗТрудоёмкость = Макет.ПолучитьОбласть("МПЗ|Трудоёмкость");
ОблМПЗРасценка = Макет.ПолучитьОбласть("МПЗ|Расценка");
ОблМПЗРасценкаИтого = Макет.ПолучитьОбласть("МПЗ|РасценкаИтого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецНормаВремени = Макет.ПолучитьОбласть("Конец|НормаВремени");
ОблКонецТрудоёмкость = Макет.ПолучитьОбласть("Конец|Трудоёмкость");
ОблКонецРасценка = Макет.ПолучитьОбласть("Конец|Расценка");
ОблКонецРасценкаИтого = Макет.ПолучитьОбласть("Конец|РасценкаИтого");	

ОблШапкаОбщая.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщая);
	Если ВидОтчёта = 1 Тогда
		Для каждого ТО Из СписокТО Цикл	
		ОблШапкаНормаВремени.Параметры.ТО = ТО.Значение;
		ТабДок.Присоединить(ОблШапкаНормаВремени);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблШапкаТрудоёмкость);
	Иначе	
		Для каждого ТО Из СписокТО Цикл	
		ОблШапкаРасценка.Параметры.ТО = ТО.Значение;
		ТабДок.Присоединить(ОблШапкаРасценка);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблШапкаРасценкаИтого);
	КонецЕсли;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Канбан В(&СписокВидовКанбанов)";
Запрос.УстановитьПараметр("СписокВидовКанбанов",СписокВидовКанбанов);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Если Не ПоказыватьЗапрещённые Тогда
	Запрос.Текст = Запрос.Текст + " И СтатусыМПЗСрезПоследних.Статус <> &Статус";	
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
	КонецЕсли; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка,глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование));
	КонецЦикла;
СписокНоменклатуры.СортироватьПоПредставлению();
	Для каждого МПЗ Из СписокНоменклатуры Цикл 
	ОблМПЗОбщая.Параметры.Наименование = СокрЛП(МПЗ.Значение.Наименование);
	ОблМПЗОбщая.Параметры.МПЗ = МПЗ.Значение;
	ОблМПЗОбщая.Параметры.Статус = ПолучитьСтатус(МПЗ.Значение,Отчет.НаДату);
	ТабДок.Вывести(ОблМПЗОбщая);
		Если ВидОтчёта = 1 Тогда
		Трудоёмкость = 0;
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ.Значение,ТО.Значение));
			ОблМПЗНормаВремени.Параметры.НВ = НормыВремени.НормаВремени;
			ТабДок.Присоединить(ОблМПЗНормаВремени);
			Трудоёмкость = Трудоёмкость + НормыВремени.НормаВремени;
			КонецЦикла;
		ОблМПЗТрудоёмкость.Параметры.Трудоёмкость = Трудоёмкость;
		ТабДок.Присоединить(ОблМПЗТрудоёмкость);
		Иначе
		РасценкаИтого = 0;
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ.Значение,ТО.Значение));
			ОблМПЗНормаВремени.Параметры.НВ = НормыВремени.НормаВремени;
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",ТО.Значение));
			Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
			ОблМПЗРасценка.Параметры.Расценка = Расценка;
			ТабДок.Присоединить(ОблМПЗРасценка);
			РасценкаИтого = РасценкаИтого + Расценка;
			КонецЦикла;
		ОблМПЗРасценкаИтого.Параметры.РасценкаИтого = РасценкаИтого;
		ТабДок.Присоединить(ОблМПЗРасценкаИтого);
		КонецЕсли;
			Если ПоказатьЭтапыПроизводства Тогда	
			РаскрытьНаМПЗ(МПЗ.Значение);
			КонецЕсли; 
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщая);
	Если ВидОтчёта = 1 Тогда
		Для каждого ТО Из СписокТО Цикл	
		ТабДок.Присоединить(ОблКонецНормаВремени);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблКонецТрудоёмкость);
	Иначе	
		Для каждого ТО Из СписокТО Цикл	
		ТабДок.Присоединить(ОблКонецРасценка);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблКонецРасценкаИтого);
	КонецЕсли;
ТабДок.ФиксацияСверху = 2;
ТабДок.ФиксацияСлева = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокВидовКанбанов) Тогда
		СформироватьНаСервере();		
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
